ParkerSD/FlashBlaster/nRF5_SDK_16.0.0_98a08e2/examples/ble_peripheral/ble_app_uart/pca10056/s140/ses/oled.c
		}
	}
	else if (iSize == FONT_NORMAL) // draw 8x8 font
	{
		oledSetPosition(x*8, y);
		if (iLen + x > 16) iLen = 16 - x; // can't display it
		if (iLen < 0)return -1;

		for (i=0; i<iLen; i++)
		{
			s = &ucFont[(unsigned char)szMsg[i] * 8];
			oledWriteDataBlock(s, 8); // write character pattern
		}
	}
*/
//	else
//	{
	// support for small font only
		oledSetPosition(x*6, y);
		if (iLen + x > 21) iLen = 21 - x;
		if (iLen < 0) return -1;
		for (i=0; i<iLen; i++)
		{
			s = &ucSmallFont[(unsigned char)szMsg[i]*6];
			oledWriteDataBlock(s, 6);
		}
//	}
	return 0;
} /* oledWriteString() */

// Fill the frame buffer with a byte pattern
// e.g. all off (0x00) or all on (0xff)
int clear_display(unsigned char ucData)
{
	int y;
	unsigned char temp[128];
	int iLines, iCols;

	iLines = 8; // iLines = (oled_type == OLED_128x32 || oled_type == OLED_64x32) ? 4:8;
	iCols = 8; // iCols = (oled_type == OLED_64x32) ? 4:8;

        memset(temp, ucData, 128);
	for (y=0; y<iLines; y++)
	{
		oledSetPosition(0,y); // set to (0,Y)
		oledWriteDataBlock(temp, iCols*16);
	} // for y
	
        list_singleton->boxPresent = false;
        list_singleton->headerPresent = false;

	return 0;
} /* clear_display() */

void draw_box(int y) // top left corner of full width box = point (0, y) 
{
    for(int f=0; f<128; f++)
    {
	oledSetPixel(f, y, 1); //draw x lines
	oledSetPixel(f, y+20, 1); 
    }
	
    for(int g=0; g<20; g++)
    {
	oledSetPixel(0, y+g, 1); //draw y lines
	oledSetPixel(127, y+g, 1); 
    }
        
    list_singleton->boxPresent = true; 
}

void draw_text(int y, char* text) // 0 < y < 8
{   
    oledWriteString(1, y, text, FONT_SMALL);
}

void draw_header(void)
{
    draw_text(1, list_singleton->header);
    list_singleton->headerPresent = true;
}

list_struct* list_new(void)
{
    list_struct* listx = malloc(sizeof(listx)); 
    
    listx->currentList = NULL;
    listx->header = NULL;
    listx->item0 = NULL; // based on button presses the order will change and items will be rerendered
    listx->item1 = NULL; 
    listx->item2 = NULL; 
    listx->item3 = NULL; 
    listx->item4 = NULL; 

    listx->boxPresent = false; 
    listx->headerPresent = false; 

    return listx;

    //x->item0 = flash_fetch(item0); //need to create entire list struct here from file system
    //x->item1 = flash_fetch(item1);
}

void list_init(void)
{
    list_singleton = list_new();
}

//TODO: implement set_current_project() function based on selected item, same for chip and file, render name strings only 

system_struct* system_new(void) //TODO file system, shoulf be constructed in Flash, only NAMES fetched from flash here for later display (CURRENTLY INITING WHOLE FILESSYTEM IN RAM)
{                                                            
    system_struct* systemx = malloc(sizeof(systemx)); 
    
    systemx->systemName = firmware_version_fetch(); 

    if (projectNames[0] != NULL) // replace with Flash value fetch function to determine presence
    {
        systemx->project1 = project_new();
    }
    else
    {
        systemx->project1 = NULL;
    }

        systemx->project2 = project_new();

        systemx->project3 = project_new();

        systemx->project4 = project_new();

        systemx->project5 = project_new();


    return systemx;

}

void system_init(void)
{
    system_singleton = system_new();  // formerly global
}

char* firmware_version_fetch(void)
{
    //fetch FW version from flash 

    return systemFirmware;
}

char* project_name_fetch(void)
{
    //fetch project name from flash 

    return projectNames[projectIterator];

}

char* chip_name_fetch(void)
{
    //fetch chip name from flash 

    return chipNames[chipIterator];

}

char* file_name_fetch(void)
{
    //fetch file name from flash 

    return fileNames[fileIterator];

}



file_struct* file_new(void)
{
    file_struct* filex = malloc(sizeof(filex)); 

    filex->fileName = file_name_fetch(); 
    filex->filePtr = NULL;

    fileIterator++; 
    return filex;
}



chip_struct* chip_new(void) //TODO: render only existing files 
{
    chip_struct* chipx = malloc(sizeof(chipx));

    chipx->chipName = chip_name_fetch(); 

    if (fileNames[0] != NULL) // replace with Flash value fetch function to determine presence
    {
        chipx->file1 = file_new();
    }
    else
    {
        chipx->file1 = NULL;
    }

    if (fileNames[1] != NULL)
    {
        chipx->file2 = file_new();
    }
    else
    {
        chipx->file2 = NULL;
    }
    
    chipIterator++;
    return chipx;
}



project_struct* project_new(void) //TODO: render only existing chips
{
    project_struct* projectx = malloc(sizeof(projectx));

    projectx->projectName = project_name_fetch();

    if (chipNames[0] != NULL) // replace with Flash value fetch function to determine presence
    {
        projectx->chip1 = chip_new();
    }
    else
    {
        projectx->chip1 = NULL;
    }

    if (chipNames[1] != NULL)
    {
        projectx->chip2 = chip_new();
    }
    else
    {
        projectx->chip2 = NULL;
    }
    
    projectIterator++;
    return projectx; 
}



void draw_initial_screen(void) //TODO Problem is here, with passing pointer within struct to pointer within another stuct, not related to global 
{   
    list_singleton->currentList = project;
    list_singleton->header = system_singleton->systemName; 
    list_singleton->item0 = system_singleton->project1->projectName; 
    list_singleton->item1 = system_singleton->project2->projectName;
    list_singleton->item2 = system_singleton->project3->projectName;
    list_singleton->item3 = system_singleton->project4->projectName;
    list_singleton->item4 = system_singleton->project5->projectName;

    draw_box(17);
    draw_header();
    oledWriteString(1, 3, list_singleton->item0, FONT_SMALL);
    oledWriteString(1, 5, list_singleton->item1, FONT_SMALL);
    oledWriteString(1, 7, list_singleton->item2, FONT_SMALL);
}



void clear_list(void)
{
    for(int f=2; f<126; f++)
    {
        //clear string one
        oledSetPixel(f, 24, 0);  
        oledSetPixel(f, 25, 0); 
        oledSetPixel(f, 26, 0); 
        oledSetPixel(f, 27, 0); 
        oledSetPixel(f, 28, 0); 
        oledSetPixel(f, 29, 0); 
        oledSetPixel(f, 30, 0); 
        oledSetPixel(f, 31, 0);

        //clear string two
        oledSetPixel(f, 40, 0);
        oledSetPixel(f, 41, 0); 
        oledSetPixel(f, 42, 0);
        oledSetPixel(f, 43, 0); 
        oledSetPixel(f, 44, 0); 
        oledSetPixel(f, 45, 0); 
        oledSetPixel(f, 46, 0); 
        oledSetPixel(f, 47, 0); 

