ParkerSD/FlashBlaster/nRF5_SDK_16.0.0_98a08e2/examples/ble_peripheral/ble_app_uart/pca10056/s140/ses/oled.c
        //clear string three
        oledSetPixel(f, 56, 0); 
        oledSetPixel(f, 57, 0); 
        oledSetPixel(f, 58, 0); 
        oledSetPixel(f, 59, 0); 
        oledSetPixel(f, 60, 0); 
        oledSetPixel(f, 61, 0); 
        oledSetPixel(f, 62, 0);
        oledSetPixel(f, 63, 0); 
    }
}



void rerender_list(int8_t itemHighlighted) // TODO: limit render to amount of existing items
{
    
    if(itemHighlighted == 0)
    {
        clear_list();
        oledWriteString(1, 3, list_singleton->item0, FONT_SMALL);
        oledWriteString(1, 5, list_singleton->item1, FONT_SMALL);
        oledWriteString(1, 7, list_singleton->item2, FONT_SMALL);
    }
    else if(itemHighlighted == 1)
    {   
        clear_list();
        oledWriteString(1, 3, list_singleton->item1, FONT_SMALL);
        oledWriteString(1, 5, list_singleton->item2, FONT_SMALL);
        oledWriteString(1, 7, list_singleton->item3, FONT_SMALL);
    }
    else if(itemHighlighted == 2)
    {
        clear_list();
        oledWriteString(1, 3, list_singleton->item2, FONT_SMALL);
        oledWriteString(1, 5, list_singleton->item3, FONT_SMALL);
        oledWriteString(1, 7, list_singleton->item4, FONT_SMALL);
    }
    else if(itemHighlighted == 3)
    {
        clear_list();
        oledWriteString(1, 3, list_singleton->item3, FONT_SMALL);
        oledWriteString(1, 5, list_singleton->item4, FONT_SMALL);
    }
    else if(itemHighlighted == 4)
    {
        clear_list();
        oledWriteString(1, 3, list_singleton->item4, FONT_SMALL);
    }
}



void rerender_screen(int8_t itemHighlighted, int8_t selectedItem, uint8_t screenStack) 
{   

    switch(screenStack)
    {
        case 0: 
            list_singleton->currentList = project;
            list_singleton->header = system_singleton->systemName; //set initial values for display 
            list_singleton->item0 = system_singleton->project1->projectName; 
            list_singleton->item1 = system_singleton->project2->projectName;
            list_singleton->item2 = system_singleton->project3->projectName;
            list_singleton->item3 = system_singleton->project4->projectName;
            list_singleton->item4 = system_singleton->project5->projectName;
            break;

        case 1: 
            list_singleton->currentList = chip;
            list_singleton->header = chipHeader;
            if(selectedItem == 0)
            {
                selectedProject = 0; 
                list_singleton->item0 = system_singleton->project1->chip1->chipName;
                list_singleton->item1 = system_singleton->project1->chip2->chipName;
                list_singleton->item2 = NULL;
                list_singleton->item3 = NULL;
                list_singleton->item4 = NULL;
            }
            else if(selectedItem == 1)
            {
                selectedProject = 1; 
                list_singleton->item0 = system_singleton->project2->chip1->chipName;
                list_singleton->item1 = system_singleton->project2->chip2->chipName;
                list_singleton->item2 = NULL;
                list_singleton->item3 = NULL;
                list_singleton->item4 = NULL;
            }
            else if(selectedItem == 2)
            {
                selectedProject = 2; 
                list_singleton->item0 = system_singleton->project3->chip1->chipName;
                list_singleton->item1 = system_singleton->project3->chip2->chipName;
                list_singleton->item2 = NULL;
                list_singleton->item3 = NULL;
                list_singleton->item4 = NULL;
            }
            else if(selectedItem == 3)
            {
                selectedProject = 3; 
                list_singleton->item0 = system_singleton->project4->chip1->chipName;
                list_singleton->item1 = system_singleton->project4->chip2->chipName;
                list_singleton->item2 = NULL;
                list_singleton->item3 = NULL;
                list_singleton->item4 = NULL;
            }
            else if(selectedItem == 4)
            {
                selectedProject = 4; 
                list_singleton->item0 = system_singleton->project5->chip1->chipName;
                list_singleton->item1 = system_singleton->project5->chip2->chipName;
                list_singleton->item2 = NULL;
                list_singleton->item3 = NULL;
                list_singleton->item4 = NULL;
            }
            break;

        case 2: 
            list_singleton->currentList = file;
            list_singleton->header = fileHeader;
            if(selectedItem == 0 && selectedProject == 0) // project 1 chip 1 selected
            {
                list_singleton->item0 = system_singleton->project1->chip1->file1->fileName;
                list_singleton->item1 = system_singleton->project1->chip1->file2->fileName;
                list_singleton->item2 = NULL;
                list_singleton->item3 = NULL;
                list_singleton->item4 = NULL;
            }
            else if(selectedItem == 1 && selectedProject == 0) // project 1 chip 2 selected
            {
                list_singleton->item0 = system_singleton->project1->chip2->file1->fileName;
                list_singleton->item1 = system_singleton->project1->chip2->file2->fileName;
                list_singleton->item2 = NULL;
                list_singleton->item3 = NULL;
                list_singleton->item4 = NULL;
            }
            else if(selectedItem == 0 && selectedProject == 1) // project 2 chip 1 selected
            {
                list_singleton->item0 = system_singleton->project2->chip1->file1->fileName;
                list_singleton->item1 = system_singleton->project2->chip1->file2->fileName;
                list_singleton->item2 = NULL;
                list_singleton->item3 = NULL;
                list_singleton->item4 = NULL;
            }
            else if(selectedItem == 1 && selectedProject == 1) // project 2 chip 2 selected
            {
                list_singleton->item0 = system_singleton->project2->chip2->file1->fileName;
                list_singleton->item1 = system_singleton->project2->chip2->file2->fileName;
                list_singleton->item2 = NULL;
                list_singleton->item3 = NULL;
                list_singleton->item4 = NULL;
            }
            else if(selectedItem == 0 && selectedProject == 2) // project 3 chip 1 selected
            {
                list_singleton->item0 = system_singleton->project3->chip1->file1->fileName;
                list_singleton->item1 = system_singleton->project3->chip1->file2->fileName;
                list_singleton->item2 = NULL;
                list_singleton->item3 = NULL;
                list_singleton->item4 = NULL;
            }
            else if(selectedItem == 1 && selectedProject == 2) // project 3 chip 2 selected
            {
                list_singleton->item0 = system_singleton->project3->chip2->file1->fileName; //runs out of filenames here
                list_singleton->item1 = system_singleton->project3->chip2->file2->fileName;
                list_singleton->item2 = NULL;
                list_singleton->item3 = NULL;
                list_singleton->item4 = NULL;
            }
            else if(selectedItem == 0 && selectedProject == 3) // project 4 chip 1 selected
            {
                list_singleton->item0 = system_singleton->project4->chip1->file1->fileName;
                list_singleton->item1 = system_singleton->project4->chip1->file2->fileName;
                list_singleton->item2 = NULL;
                list_singleton->item3 = NULL;
                list_singleton->item4 = NULL;
            }
            else if(selectedItem == 1 && selectedProject == 3) // project 4 chip 2 selected
            {
                list_singleton->item0 = system_singleton->project4->chip2->file1->fileName;
                list_singleton->item1 = system_singleton->project4->chip2->file2->fileName;
                list_singleton->item2 = NULL;
                list_singleton->item3 = NULL;
                list_singleton->item4 = NULL;
            }
            else if(selectedItem == 0 && selectedProject == 4) // project 5 chip 1 selected
            {
                list_singleton->item0 = system_singleton->project5->chip1->file1->fileName;
                list_singleton->item1 = system_singleton->project5->chip1->file2->fileName;
                list_singleton->item2 = NULL;
                list_singleton->item3 = NULL;
                list_singleton->item4 = NULL;
            }
            else if(selectedItem == 1 && selectedProject == 4) // project 5 chip 2 selected
            {
                list_singleton->item0 = system_singleton->project5->chip2->file1->fileName;
                list_singleton->item1 = system_singleton->project5->chip2->file2->fileName;
                list_singleton->item2 = NULL;
                list_singleton->item3 = NULL;
                list_singleton->item4 = NULL;
            }
            break; 

        default:
            break; 
    }

    rerender_list(itemHighlighted);

    if(list_singleton->boxPresent == false)
    {
        draw_box(17);
    }

    if(list_singleton->headerPresent == false)
    {
        draw_header();
    }
}



unsigned char ucSmallFont[] = {0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x3e,0x45,0x51,0x45,0x3e,0x00,0x3e,0x6b,0x6f,
	0x6b,0x3e,0x00,0x1c,0x3e,0x7c,0x3e,0x1c,0x00,0x18,0x3c,0x7e,0x3c,0x18,0x00,0x30,
	0x36,0x7f,0x36,0x30,0x00,0x18,0x5c,0x7e,0x5c,0x18,0x00,0x00,0x18,0x18,0x00,0x00,
	0x00,0xff,0xe7,0xe7,0xff,0xff,0x00,0x3c,0x24,0x24,0x3c,0x00,0x00,0xc3,0xdb,0xdb,
	0xc3,0xff,0x00,0x30,0x48,0x4a,0x36,0x0e,0x00,0x06,0x29,0x79,0x29,0x06,0x00,0x60,
	0x70,0x3f,0x02,0x04,0x00,0x60,0x7e,0x0a,0x35,0x3f,0x00,0x2a,0x1c,0x36,0x1c,0x2a,
	0x00,0x00,0x7f,0x3e,0x1c,0x08,0x00,0x08,0x1c,0x3e,0x7f,0x00,0x00,0x14,0x36,0x7f,
	0x36,0x14,0x00,0x00,0x5f,0x00,0x5f,0x00,0x00,0x06,0x09,0x7f,0x01,0x7f,0x00,0x22,
	0x4d,0x55,0x59,0x22,0x00,0x60,0x60,0x60,0x60,0x00,0x00,0x14,0xb6,0xff,0xb6,0x14,
	0x00,0x04,0x06,0x7f,0x06,0x04,0x00,0x10,0x30,0x7f,0x30,0x10,0x00,0x08,0x08,0x3e,
	0x1c,0x08,0x00,0x08,0x1c,0x3e,0x08,0x08,0x00,0x78,0x40,0x40,0x40,0x40,0x00,0x08,
	0x3e,0x08,0x3e,0x08,0x00,0x30,0x3c,0x3f,0x3c,0x30,0x00,0x03,0x0f,0x3f,0x0f,0x03,
	0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x06,0x5f,0x06,0x00,0x00,0x07,0x03,0x00,
	0x07,0x03,0x00,0x24,0x7e,0x24,0x7e,0x24,0x00,0x24,0x2b,0x6a,0x12,0x00,0x00,0x63,
	0x13,0x08,0x64,0x63,0x00,0x36,0x49,0x56,0x20,0x50,0x00,0x00,0x07,0x03,0x00,0x00,
	0x00,0x00,0x3e,0x41,0x00,0x00,0x00,0x00,0x41,0x3e,0x00,0x00,0x00,0x08,0x3e,0x1c,
	0x3e,0x08,0x00,0x08,0x08,0x3e,0x08,0x08,0x00,0x00,0xe0,0x60,0x00,0x00,0x00,0x08,
	0x08,0x08,0x08,0x08,0x00,0x00,0x60,0x60,0x00,0x00,0x00,0x20,0x10,0x08,0x04,0x02,
	0x00,0x3e,0x51,0x49,0x45,0x3e,0x00,0x00,0x42,0x7f,0x40,0x00,0x00,0x62,0x51,0x49,
	0x49,0x46,0x00,0x22,0x49,0x49,0x49,0x36,0x00,0x18,0x14,0x12,0x7f,0x10,0x00,0x2f,
	0x49,0x49,0x49,0x31,0x00,0x3c,0x4a,0x49,0x49,0x30,0x00,0x01,0x71,0x09,0x05,0x03,
	0x00,0x36,0x49,0x49,0x49,0x36,0x00,0x06,0x49,0x49,0x29,0x1e,0x00,0x00,0x6c,0x6c,
	0x00,0x00,0x00,0x00,0xec,0x6c,0x00,0x00,0x00,0x08,0x14,0x22,0x41,0x00,0x00,0x24,
	0x24,0x24,0x24,0x24,0x00,0x00,0x41,0x22,0x14,0x08,0x00,0x02,0x01,0x59,0x09,0x06,
	0x00,0x3e,0x41,0x5d,0x55,0x1e,0x00,0x7e,0x11,0x11,0x11,0x7e,0x00,0x7f,0x49,0x49,
	0x49,0x36,0x00,0x3e,0x41,0x41,0x41,0x22,0x00,0x7f,0x41,0x41,0x41,0x3e,0x00,0x7f,
	0x49,0x49,0x49,0x41,0x00,0x7f,0x09,0x09,0x09,0x01,0x00,0x3e,0x41,0x49,0x49,0x7a,
	0x00,0x7f,0x08,0x08,0x08,0x7f,0x00,0x00,0x41,0x7f,0x41,0x00,0x00,0x30,0x40,0x40,
	0x40,0x3f,0x00,0x7f,0x08,0x14,0x22,0x41,0x00,0x7f,0x40,0x40,0x40,0x40,0x00,0x7f,
	0x02,0x04,0x02,0x7f,0x00,0x7f,0x02,0x04,0x08,0x7f,0x00,0x3e,0x41,0x41,0x41,0x3e,
	0x00,0x7f,0x09,0x09,0x09,0x06,0x00,0x3e,0x41,0x51,0x21,0x5e,0x00,0x7f,0x09,0x09,
	0x19,0x66,0x00,0x26,0x49,0x49,0x49,0x32,0x00,0x01,0x01,0x7f,0x01,0x01,0x00,0x3f,
	0x40,0x40,0x40,0x3f,0x00,0x1f,0x20,0x40,0x20,0x1f,0x00,0x3f,0x40,0x3c,0x40,0x3f,
	0x00,0x63,0x14,0x08,0x14,0x63,0x00,0x07,0x08,0x70,0x08,0x07,0x00,0x71,0x49,0x45,
	0x43,0x00,0x00,0x00,0x7f,0x41,0x41,0x00,0x00,0x02,0x04,0x08,0x10,0x20,0x00,0x00,
	0x41,0x41,0x7f,0x00,0x00,0x04,0x02,0x01,0x02,0x04,0x00,0x80,0x80,0x80,0x80,0x80,
	0x00,0x00,0x03,0x07,0x00,0x00,0x00,0x20,0x54,0x54,0x54,0x78,0x00,0x7f,0x44,0x44,
	0x44,0x38,0x00,0x38,0x44,0x44,0x44,0x28,0x00,0x38,0x44,0x44,0x44,0x7f,0x00,0x38,
	0x54,0x54,0x54,0x08,0x00,0x08,0x7e,0x09,0x09,0x00,0x00,0x18,0xa4,0xa4,0xa4,0x7c,
	0x00,0x7f,0x04,0x04,0x78,0x00,0x00,0x00,0x00,0x7d,0x40,0x00,0x00,0x40,0x80,0x84,
	0x7d,0x00,0x00,0x7f,0x10,0x28,0x44,0x00,0x00,0x00,0x00,0x7f,0x40,0x00,0x00,0x7c,
	0x04,0x18,0x04,0x78,0x00,0x7c,0x04,0x04,0x78,0x00,0x00,0x38,0x44,0x44,0x44,0x38,
	0x00,0xfc,0x44,0x44,0x44,0x38,0x00,0x38,0x44,0x44,0x44,0xfc,0x00,0x44,0x78,0x44,
	0x04,0x08,0x00,0x08,0x54,0x54,0x54,0x20,0x00,0x04,0x3e,0x44,0x24,0x00,0x00,0x3c,
	0x40,0x20,0x7c,0x00,0x00,0x1c,0x20,0x40,0x20,0x1c,0x00,0x3c,0x60,0x30,0x60,0x3c,
	0x00,0x6c,0x10,0x10,0x6c,0x00,0x00,0x9c,0xa0,0x60,0x3c,0x00,0x00,0x64,0x54,0x54,
	0x4c,0x00,0x00,0x08,0x3e,0x41,0x41,0x00,0x00,0x00,0x00,0x77,0x00,0x00,0x00,0x00,
	0x41,0x41,0x3e,0x08,0x00,0x02,0x01,0x02,0x01,0x00,0x00,0x3c,0x26,0x23,0x26,0x3c};